In [19]:
import pandas as pd

In [20]:
data = {'A' : [2,3,4], 'B' : [5,6,7]}

In [21]:
df = pd.DataFrame(data)
df

   A  B
0  2  5
1  3  6
2  4  7

#### apply() --- creating new col 
.apply() is used to apply a function along an axis of a DataFrame or on values in a Series.

In [25]:
# apply with custom function

In [24]:
def fun(df):
    return df['A'] + df['B']

df['row_sum'] = df.apply(fun, axis=1)
df

   A  B  row_sum
0  2  5        7
1  3  6        9
2  4  7       11

In [15]:
# apply with lambda

In [16]:
df['new_col'] = df['A'].apply(lambda x:x**2)

In [17]:
df

   A  B  row_sum  new_col
0  2  5        7        4
1  3  6        9        9
2  4  7       11       16